## The First steps
Data cleaning and exploration

In [8]:
import pandas as pd

df = pd.read_csv("salaries_by_college_major.csv")

df.head()

df.shape
#To know the column labels 
df.columns#This return a list of column labels

#Missing values and junk Data
#First we look for NaN (Not A Number) or blank cells in the data
df.isna()
#Then check the last couple of rows to clarify
df.tail()

#To delete the last row
#We do this two ways by deletin cell manually or the second way use the .dropna() method

clean_df = df.dropna()

clean_df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

# Accessing Columns and Individual Cells in a Dataframe
This is done using the squar bracket notation which will return a column with indices

In [17]:
#this will return the max value of the dataframe in the specific cloumn using method max()
clean_df['Starting Median Salary'].max()
#This will return the row index of the highest salary
clean_df['Starting Median Salary'].idxmax()

#This will return the name of the major that corresponds to the particular row using .loc (Location) property
clean_df['Undergraduate Major'].loc[43]

#To retrieve an entire row we use loc on the dataframe
clean_df.loc[43]

Undergraduate Major                  Physician Assistant
Starting Median Salary                           74300.0
Mid-Career Median Salary                         91700.0
Mid-Career 10th Percentile Salary                66400.0
Mid-Career 90th Percentile Salary               124000.0
Group                                               STEM
Name: 43, dtype: object

# Challenge

In [18]:
#This will show the highest mid-career salary
clean_df["Mid-Career Median Salary"].max()

107000.0

In [23]:
#Lowest starting salary major and the salary after graduating
lowest_start_ind = clean_df["Starting Median Salary"].idxmin()
#The lowest earning major
clean_df["Undergraduate Major"].loc[lowest_start_ind]
clean_df["Mid-Career Median Salary"].loc[lowest_start_ind]

53100.0

In [29]:
#Lowest mid-career salary and expected salary from this major
Lowest_mid_salary_major = clean_df["Mid-Career Median Salary"].idxmin()
clean_df["Undergraduate Major"].loc[Lowest_mid_salary_major]

clean_df["Starting Median Salary"].loc[Lowest_mid_salary_major]

34900.0

# Lowest Risk Majors
A low-risk major is a degree where there is a small difference between the lowest and highest salaries.
If the difference between the 10th percentile and the 90th percentile earnings of the major is small, then you can be more certain about your salary after you graduate.

In [31]:
#There are 2 methods to find the difference
clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']
#Alternatively using pandas we can 
spread_col = clean_df['Mid-Career 90th Percentile Salary'].subtract(clean_df['Mid-Career 10th Percentile Salary'])
#We use insert() to add another column to the dataframe
#The first argument is the position of the column, the second is the name of the column and the third is the value of each row from the variable holding the method to calculate the result
clean_df.insert(1, 'Spread', spread_col)
clean_df.head()

,Undergraduate Major,Spread,spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,109800.0,109800.0,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,96700.0,96700.0,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,113700.0,113700.0,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,104200.0,104200.0,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,85400.0,85400.0,41600.0,76800.0,50600.0,136000.0,Business

# Sorting by the lowest Spread
we will use the sort_values() method which bydefault arranges the values in ascending order

In [32]:
#After sorting the Spread Column
low_risk = clean_df.sort_values('Spread')
#You show the first 5 rows with columns sorted in response to the sorted column (Spread)
low_risk[['Undergraduate Major', 'Spread']]. head()

           Undergraduate Major   Spread
40                     Nursing  50700.0
43         Physician Assistant  57600.0
41                   Nutrition  65300.0
49                     Spanish  65400.0
27  Health Care Administration  66400.0

# Challenge

In [36]:
#Highest potential majors
#These are the majors that have high 90th percentile
highest_potential = clean_df.sort_values('Mid-Career 90th Percentile Salary', ascending=False)
highest_potential[['Undergraduate Major', 'Mid-Career 90th Percentile Salary']].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                           210000.0
22               Finance                           195000.0
8   Chemical Engineering                           194000.0
37                  Math                           183000.0
44               Physics                           178000.0

In [37]:
#Highest spread will be the greatest values of the spread column
#In otherwords major with the lowest risk
highest_spread = clean_df.sort_values('Spread', ascending=False)
highest_spread[['Undergraduate Major', 'Spread']].head()

   Undergraduate Major    Spread
17           Economics  159400.0
22             Finance  147800.0
37                Math  137800.0
36           Marketing  132900.0
42          Philosophy  132500.0

In [38]:
#mid-career median salary with the highest opportunity
high_mid_opportunity = clean_df.sort_values('Mid-Career Median Salary', ascending=False)
high_mid_opportunity[['Undergraduate Major', 'Mid-Career Median Salary']].head()

       Undergraduate Major  Mid-Career Median Salary
8     Chemical Engineering                  107000.0
12    Computer Engineering                  105000.0
19  Electrical Engineering                  103000.0
1    Aerospace Engineering                  101000.0
17               Economics                   98600.0

# Grouping and Pivoting Data with Pandas
Often times you will wnt to sum rows that belong to a particular category. for example, which category of degree has the highest average salary? is it STEM, business ot HASS
To do this we will use the groupby() method

In [39]:
clean_df.groupby('Group').count()

,Undergraduate Major,Spread,G_spread,spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,,,,
Business,12,12,12,12,12,12,12,12
HASS,22,22,22,22,22,22,22,22
STEM,16,16,16,16,16,16,16,16

In [42]:
#to format the results using pandas we set the format to 
pd.options.display.float_format = '{:,.2f}'.format
#Finding the average salary in different groups
clean_df.groupby('Group').mean()

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,"103,958.33","44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"95,218.18","37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"101,600.00","53,862.50","90,812.50","56,025.00","157,625.00"